const REGULAR = {
  // 登录 - 5-32位非中文字符 (密码)
  password: /^[^\u4e00-\u9fa5]{5,32}$/,
  // 注册 - 8-32位非中文字符 (密码)
  setPassword: /^[^\u4e00-\u9fa5]{8,32}$/,
  // 非零的正整数
  positive: /^[1-9]\d*$/,
  // 正整数
  positiveOrZero:/^[0-9]\d*$/,
  //数字或小数
  number:/^\d+(\.\d+)?$/,
  //带1位或2位小数
  currency: /^\d*[.]?\d{1,2}$/,
  // 图像验证码（4位）
  identCode: /\d{4}/,
  msgCode: /\d{6}/,
  email:/\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*/,
  // 手机号码
  mobileNumber: /^1[3456789]\d{9}$/,
  // 11位数字
  mobileTest: /\d{11}/,
  // 固定电话
  telephone: /\d{3}-\d{8}|\d{4}-\d{7}/,
  telephoneNew: /\d{3}-?\d{4,9}|\d{4}-?\d{3,8}/,
  // 固定电话含分机号
  telephoneFull: /^(\d{3,4}-)\d{7,8}(|([-\u8f6c]{1}\d{1,5}))$/,
  // 手机/固话
  mobileTelephone: /((\d{11})|^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$)/,
  idCard: /^[1-9]\d{5}[1-9]\d{3}((0[1-9])|(1[0-2]))((0[1-9])|([1-2]\d)|(3[0-1]))((\d{4})|(\d{3}[Xx]))$/,
  landlinePhone: /(^(0[0-9]{2,3}-)?([2-9][0-9]{6,7}|400[0-9]{6,7})(-[0-9]{1,7})?$)|(^(400-)?[2-9]{6,7}$)/,
  landlinePhone3: /^(((\+?00[- ]?86[- ]?)|(\+?86[- ]?))?((010|02\d|0[3-9]\d{2,3})[- ]?)?\d{7,8}([-]\d{1,8})?)$|(400[-\d]{5,10}([-]\d{1,6})?)$|(800[-\d]{5,10}([-]\d{1,6})?)$/,
  landlinePhone2: /^[\d-(),，]{5,20}$/,
  mobilePhone2: /^(0|86|17951)?(13[0-9]|15[012356789]|17[0-9]|18[0-9]|19[0-9]|14[057]|165|166|168|199|198)[0-9]{8}$/,
  mobilePhone: /^(1[3-9])\d{9}$/,
  includeChineseCharacter: /[\u4e00-\u9fa5]/,
  chineseAndEnglish: /^[\u4e00-\u9fa5_a-zA-Z]+$/,
  chineseOnly: /^[\u2E80-\uFE4F]+$/,
  // 中文生僻字+中文符号+数字
  chineseText: /^[\u2E80-\uFE4F0-9A-Za-z]*[\u3002|\uff1f|\uff01|\uff0c|\u3001|\uff1b|\uff1a|\u201c|\u201d|\u2018|\u2019|\uff08|\uff09|\u300a|\u300b|\u3008|\u3009|\u3010|\u3011|\u300e|\u300f|\u300c|\u300d|\ufe43|\ufe44|\u3014|\u3015|\u2026|\u2014|\uff5e|\ufe4f|\uffe5]*$/,
  textAndNumber: /^[\u4e00-\u9fa5a-zA-Z0-9]+$/,
  //普通文本(非特殊字符)
  genaralText: /^[\u4E00-\u9FA5A-Za-z0-9()（）\-－*,，.~。？?！@#￥%……&*——+!@#$%^&*()_{}《》\\|【】\[\]<>!@#$%^&*_\u0020\u3000]+$/,
  externalLink: /^(https?:|mailto:|tel:)/,
  //唯品会入库单号
  vipshopCode: /^[a-zA-Z0-9]{10}(-[a-zA-Z0-9]{1,4})?$/,
  //尺寸
  size: /^\d{1,9}\*\d{1,9}\*\d{1,9}(\*\d{1,9})?$/,
  // 运单号为7、11位纯数字或15位字符
  waybillNo: /^(\d{7}|\d{11}|[0-9a-zA-Z]{15})$/,
  // 订单号
  orderNo: /(^XD)[0-9]{6}\-[0-9]{7}$/,
  emoji: /[\uD83C|\uD83D|\uD83E][\uDC00-\uDFFF][\u200D|\uFE0F]|[\uD83C|\uD83D|\uD83E][\uDC00-\uDFFF]|[0-9|*|#]\uFE0F\u20E3|[0-9|#]\u20E3|[\u203C-\u3299]\uFE0F\u200D|[\u203C-\u3299]\uFE0F|[\u2122-\u2B55]|\u303D|[\A9|\AE]\u3030|\uA9|\uAE|\u3030/ig,
  // 整数正则
  intNum: /^[1-9]\d*$/,
  // 2位小数 或整数的正则
  decNum: /^[0-9]+\.{0,1}[0-9]{0,2}$/,
  //不支持纯数字和特殊字符
  text1: /([A-Za-z\u2E80-\uFE4F](?![\u3000-\u303F])){1,32}/,
  //不支持空格和特殊字符
  text2: /^([\u2E80-\uFE4FA-Za-z0-9-.·（）()](?![\u3000-\u303F])){2,30}$/,
  //真实姓名
  text3: /^(?=.*[\u2E80-\uFE4FA-Za-z])[\s\S]{2,30}$/,
  //不可为纯数字或纯符号
  text4: /^(?=.*[\u4E00-\u9FA5A-Za-z])/
}

export default REGULAR
