<template>
  <!-- 服务条款 -->
  <el-dialog title="服务条款" class="terms-service" custom-class="admin-dialog" :visible.sync="visibleFlag" width="1000px">
    <el-scrollbar style="height: 500px;">
      <div class="content">
        <h1>《电子运单契约条款》</h1>
        <p>
          与您通过本客户端缔约的主体是跨越速运集团有限公司或其子公司、分公司、关联公司（简称：本公司），签订地为深圳市宝安区。<b>您同意遵守跨越速运客户端（包含APP、小程序、公众号、官网、网页、PC客户端等服务载体）所公示的《用户协议》、《隐私政策》、《运输契约条款》、《禁运物品清单》、《不承保托寄物目录》及该等文件不时修订的内容</b>，并同意本公司按照法律法规和隐私政策处理您提供的运单信息。
        </p>
        <p>
          请您在使用本客户端前，认真阅读本《电子运单契约条款》（以下简称：本条款）的全部内容，特别是<b>字体加粗标识</b>的部分，<b>您点击“同意”或“下一步”，或您使用本公司服务，或者以其他任何明示或者默示方式表示接受本协议的，均视为您已阅读并同意签署本协议</b>。
        </p>
        <h3>一、注册及下单</h3>
        <p>1.首次下单前需要通过对应商务获取客户编码、客户端登录密码，按照客户端提示绑定手机号，根据提示填写托运人信息后下单。</p>
        <p>2.客户编码和绑定手机号是识别托运人身份、寄件物品、结算的标识，请妥善保管好您的客户编码和客户端登录密码。<b>通过注册手机号在客户端进行的任何操作均视为您的行为并对此负责</b>。</p>
        <p>
          3.您同意本公司对运单上的信息采取保密措施以保护您的个人信息，您的下单信息和运单内容以本客户端显示为准。您下单后，系统可能会向您的手机号发送一条短信息，提示本次下单的内容，如果您对短信息的内容有异议，应当在2日内向本公司提出，逾期没有提出异议的，本次运单内容以短信息载明的内容为准。
        </p>
        <h3>二、承运</h3>
        <p>
          <b>1.本公司的报价单为您委托本公司承运的参考和要约邀请，您下单后本公司会对托寄物称重并告知您本次运费金额，您对运费无异议本公司即开始本次承运。本公司根据托寄物的重量、体积、运送难度等确定收费金额，具体以本公司最终通知您的金额为准。</b>
        </p>
        <h3>三、服务费的预存及付款方式</h3>
        <p>1.本客户端（以对应服务端功能为准）支持预存服务费，您可以通过本客户端或银行汇款的方式预存服务费。</p>
        <p>2.您预存的款项将在您完成操作后24小时内到达您的终端账户，遇节假日顺延，具体以实际到账时间为准。</p>
        <p>3. 如您在预存服务费前存在未结清的运费，您所预存运费优先支付未结清服务费，抵扣未结清服务费的部分不能享受预存优惠活动。预存服务费不计利息，本公司不对优惠活动产生的金额开具发票。</p>
        <h3>四、您的权利义务</h3>
        <p>1.您可以变更或取消托运单，但应当在起运一小时前告知本公司；未提前告知的，若托寄物还未派运，则每批次收取50元的服务费；若托寄物已经派运，按实际承运距离收取相应服务费。</p>
        <p><b>2.您应当按时与本公司进行结算，如有其他争议应与本公司积极另行协商解决，结算工作不受影响。</b></p>
        <p>
          3.您在托寄物品时，应如实申报托寄物名称、数量、重量、保价声明名等资料，准确、真实地填写运单之各项内容，否则发生一切不利后果概由您负责。对于不便当场称重的大件托寄物本公司有权运回本公司点部进行复称，本公司将复称结果记载于寄方存根联，如您有异议，应在收到本公司提供的寄方存根联后24小时内书面提出，否则视为您同意本公司复称的结果。
        </p>
        <p>4.您应当按法律法规相关规定对托寄物进行妥善包装使其适合托寄。托寄方式有特殊要求时，您应当向本公司事先说明，由本公司决定是否承运。</p>
        <p>
          5.您托寄物品时应遵守国家相关规定，保证托寄物符合国家法律法规的要求，不属于禁止生产、销售、传播的物品，不属于禁止或限制寄递的违禁品、假冒伪劣产品，符合国家规定的或与第三方约定的质量、安全、环保等标准，不会造成收件人或第三方的人身或财产损害，不侵犯第三方知识产权。
        </p>
        <p>6.您托寄物需要办理审批、检验等申报手续的，依据相关法律法规，您应当将办理完有关手续的证明文件提交本公司；您提供虚假申报材料的，由此产生的一切损失以及法律后果，均由您承担。</p>
        <p>7.您或您指定收件人对托寄物检查确认并签收后，该托寄物的毁损、灭失、短少等一切风险随之转移到您或指定收件方，本公司不承担赔偿责任，但您能证明托寄物的毁损、短少确系本公司原因造成的除外。</p>
        <p>8.您应督促收件人及时开箱验货并签收，如开箱验收托寄物时间超过2小时的，本公司有权向您收取每小时人民币200元人工费。</p>
        <p>9.您委托本公司代为收取货款的，本公司不承担货款无法收回的责任；您和付款人的纠纷由您自行解决。</p>
        <p>10.您发错货、发货数量不符或产品质量问题，导致收件人拒收的，因此而产生的返程服务费、超时费、仓储费等由您承担。</p>
        <p>
          <u><b>11.根据《邮政业寄递安全监督管理办法》的相关规定，您应当依照法律、行政法规的规定，您应防止邮件、快件过度包装，减少包装废弃物。邮件、您所提供的快件塑料包装袋、普通胶带中的铅、汞、镉、铬总量以及邮件、快件塑料包装袋中的苯类溶剂残留应当符合国家规定。您所提供的封装用品和胶带应当符合国家规定。</b></u>
        </p>
        <h3>五、本公司的权利义务</h3>
        <p>
          <b>1.本公司可以根据市场行情调整报价；您收到新的报价单后三天内未提出异议的，视为接受新的报价；如果双方未就新的报价达成一致意见，本公司给您3天缓冲期，缓冲期满后双方对报价仍不能协商一致的，本公司可以中止履行本协议，您须向本公司支付所有未支付的费用。如双方就报价另行达成一致意见，本协议恢复履行。</b>
        </p>
        <p>2.本公司可以根据自身业务经营需要或者市场变化，自行决定将托寄物交由第三方承运。</p>
        <p>
          3.本公司到达目的地有义务提前通知您指定收件人准备接收托寄物。当本公司查不到收件人或收件人拒绝签收托寄物的，本公司应及时与您联系并按照您的指示处理；您在收到本公司通知后3日内未回复的，本公司将托寄物退回始发地，由您承担往返服务费。对于超过5日既无法送达也无法退回的托寄物，本公司可以在京东、天猫等平台拍卖该托寄物，拍卖所得用以抵扣上述费用，如有剩余款项，本公司返还给您，不足部分您承担赔偿责任。
        </p>
        <p>
          4.本公司提供服务送达时效从飞机起飞或车辆离开始发城市开始计算，若派送地址为偏远地区（国家行政划分为二级或二级以下地区）需增加1至2个工作日送达。在快递业务高峰期间，包括但不限于法定节假日、“双十一”、“双十二”、“6.18”等电商平台促销期间，本公司对托寄物不做任何时效上的承诺。
        </p>
        <p>
          5.根据国家法律法规的规定，应国家司法、行政机关的要求，或出于安检的需要，本公司可以对托寄物开箱验视。如发现托寄物属于不予寄递范围或含有禁寄物品，本公司可以拒收或退回，并有权收取所发生的实际费用。
        </p>
        <p>
          <b>6.您或其指定付款人逾期支付服务费或其他费用，本公司有权留置托寄物，留置期限为10日（自通知之日起计算）。留置期间仓储保管费用由您按5元/立方米/天支付计算至您付清相关费用为止。留置期限期满，您或其指定付款人仍未支付相关费用的，本公司有权在京东、天猫等平台拍卖或通过其他方式变卖托寄物，所得价款优先抵偿行使留置权的费用后，余额用于偿还拖欠的服务费、违约金、滞纳金、留置期间保管费等其他应由您承担的费用。</b>如变卖所得价款仍不足以抵偿上述费用的，本公司仍有权向您追讨。
        </p>
        <p><b>7.本公司处分留置物前会向您送达行使留置权方案的通知，您收到本公司通知后3日内既未书面答复也未清偿所欠款项的，视为同意处置方案。</b></p>
        <h3>六、保价及货损赔偿</h3>
        <p>
          1.本公司对托寄物提供保价服务。如托寄物在托寄过程中发生毁损、灭失，保价与否将直接影响本公司赔偿的金额，由您根据托寄物的实际价值和赔偿要求,自行评估并选择是否保价，本公司建议您贵重物品和单票价值超过人民币壹仟元的托寄物尽量向本公司提出“保价”服务。具体规则如下：
        </p>
        <p>
          <b>1.1 普货类</b>（除整车运输和生鲜类之外的所有类型）
            <b>a.若您未购买保价的，如因本公司原因导致托寄物毁损、灭失，本公司按托寄物的实际损毁价值赔偿。<span class='color_red'>但月结客户货损赔偿金额不超过单票服务费的9倍，最高赔偿限额为4000元；非月结客户，本公司默认收取保价费2元，但货损赔偿金额不超过单票服务费的7倍，最高赔偿限额为2000元。</span></b>
        </p>
        <p>
          <b>1.2
            托寄物保价的，您应在运单上填写保价声明并支付保价费。发生托寄物破损、短少或灭失情形，足额保价的，按照托寄物实际毁损价值赔偿；未足额保价的，则按照（保价声明÷托寄物实际价值）×托寄物实际毁损价值进行赔偿。</b>
        </p>
        <p><b>1.3 托寄物损坏残值由甲乙双方协商处理，如归您所有本公司在核定赔偿金额时将扣除残值。</b></p>
        <p><b>1.4 保价只赔付托寄物实际损失（直接损失），即托寄物本身的物理价值，对于托寄物破损、短少或灭失引起的间接损失不做核定及赔偿，如：误工费、利润、罚款、停产、停线延误等；</b></p>
        <p><b>2.鉴于本公司无法评估托寄物的实际价值，您需按托寄物实际价值填写托寄物的保价声明，并缴纳保价费。未填写保价声明或未交保价费的，视为未保价。</b></p>
        <p>
          <b>3.关于保险公司无法承保的物品，本公司已在跨越速运官网（网址为https://www.ky-express.com/inadmitted.html）上公布
            ，您在下单前应当认真阅读并根据真实情况选择保价，如因您错误选择保价而保险公司不予理赔的，后果由您自行承担，本公司按收取保价费的80%退回。</b>
        </p>
        <p>
          <b>4.收件人收件验收时发现托寄物毁损、灭失的，须跟现场送货员确认并在运单上注明，您应于签收后2
            个工作日内以书面形式向本公司提出索赔要求，并附相关证明文件。没有在运单上注明或没有其他方式可以证明是在收件验收时发现的托寄物毁损、灭失的，视为没有毁损、灭失。</b>
        </p>
        <h3>七、违约责任</h3>
        <p>
          <b>1.您拖欠服务费的，应以拖欠金额为基数，每日按1‰向本公司支付违约金，且本公司有权向合法征信机构、信用平台披露您拖欠本公司服务费的信息，同时您还应当承担本公司为实现权利而产生的律师费、差旅费、鉴定费、勘验费、财产保全费、财产保全担保费、公证费等费用。</b>
        </p>
        <p>2.如您逾期支付服务费且其支付的费用不足以清偿全部应付款项时，您所支付的款项按照如下顺序抵充：1.实现债权或其他权利的相关费用；2.违约金；3.其他应付款项；4.服务费。</p>
        <p>3.因您托寄物质量缺陷或包装破损，致使其他托寄物品、车辆工具、机械设备被污染腐蚀、损坏，或造成人身伤亡的，您应赔偿损失并承担本公司采取补救措施产生的费用。</p>
        <p>
          <b>4.因您托寄物属于禁运物品（禁运物品目录详见跨越速运官网，网址为https://www.ky-express.com/contrabandGoods.html）或违反相关法律法规而被查没、扣留或变更配送路线，给本公司或第三人造成损失的，您应承担赔偿责任；且您应向本公司支付违约金，违约金的数额为第一次1000元，之后每发生一次增加2000元，以此类推，违约金最高不超过5万元。发生上述情形的，服务费价格上浮5%。</b>
        </p>
        <p><b>5.本公司按照通常派送方式而造成延误派送的，本公司给付您的赔偿责任仅限于本次服务费（不含保价等附加费用）。</b></p>
        <h3><b>八、免责条款</b></h3>
        <p>
          <b>1.因恶劣天气、自然灾害、政府管制、战争、疫情等不可抗力或因不可抗力导致的交通堵塞、交通事故、航班延误、航班取消等致使无法派送、延迟派送或者造成托寄物毁损、灭失或者内件短少的，本公司不承担赔偿责任。</b>
        </p>
        <p><b>2. 因托寄物本身的自然属性、合理损耗或寄/收方/第三人过错造成的损失，本公司不承担赔偿责任。</b></p>
        <p><b>3.因包装不良造成托寄物损失，本公司不承担赔偿责任；托寄物外包装无破损痕迹而内件货物破损或数量短少的，本公司不承担赔偿责任。</b></p>
        <p><b>4.您自寄件之日起满30天未提起赔偿要求的，本公司不再承担赔偿责任。</b></p>
        <p><b>5.如果您对易碎品（例如陶瓷、玻璃、灯具、液晶屏、显示器等易碎品）以及含有易碎品部件的物品没有购买保价服务的，本公司不承担赔偿责任。</b></p>
        <p><b>6.因托寄物本身的内在缺陷以及电子产品、磁带、磁片等因电磁而影响其正常使用的，本公司不承担赔偿责任。</b></p>
        <p><b>7.政府或者主管部门的检查行为、检疫限制或者司法扣押等，致使延迟派送的或托寄物价值贬损的，本公司不承担责任。</b></p>
        <p><b>8.您自行购买保险的托寄物发生毁损、灭失的，对于保险公司已经理赔的部分，本公司不再承担赔偿责任；您有证据证明保险公司未赔偿部分，本公司按照未保价托寄物的赔偿标准进行赔偿。</b></p>
        <h3>九、保密条款</h3>
        <p>1.甲乙双方均须严格保守在履行本合同过程中获知的对方的商业秘密，包括但不限于合同、报价、客户编码及密码、对接人员信息等，不得超出本合同目的使用商业秘密，并不得向第三方披露。</p>
        <h3>十、廉洁条款</h3>
        <p>1.本公司不会以任何方式向您人员提供私人便利、不正当利益或进行非正常商务宴请，并严禁本公司人员采取上述行为。如您发现本公司人员有上述情形，应及时向本公司举报。</p>
        <h3>十一、争议解决</h3>
        <p>1.凡因本合同引起的或与本合同有关的任何争议，均应提交合同签订地人民法院管辖，本合同签订地点为深圳市宝安区。</p>
        <p>2.本合同争议标的额在人民币十万元以下的，双方同意人民法院适用小额诉讼程序审理，争议案件实行一审终审。</p>
        <h3>十二、其他</h3>
        <p>
          1.“您”包含绑定手机号机主和所绑定的公司，共同对运费承担履行责任；月结客户是指与本公司已签署运输或快递合同的合作方，且在合同中约定运费的结算方式为月结。非月结客户是指除月结客户以外的寄方或到付收方。
        </p>
        <p style="text-align: right; padding: 1em 60px 0 0">跨越速运</p>

      </div>
    </el-scrollbar>
    <div slot="footer" class="dialog-footer">
      <el-button size="medium" type="primary" @click="visibleFlag = false">知道啦</el-button>
    </div>
  </el-dialog>
</template>
<script>
export default {
  props: {
    visible: {
      type: Boolean,
      default: false
    }
  },
  data () {
    return {
      visibleFlag: false

    }
  },
  watch: {
    visible (val) {
      this.visibleFlag = val
    },
    visibleFlag (val) {
      this.$emit('update:visible', val)
    }
  }
}
</script>
<style lang="scss">
  .terms-service {
    .title {
      font-size: 14px;
      text-align: center;
      color: rgba(51, 51, 51, 1);
      padding-top: 24px;
    }
    .content {
      font-size: 12px;
      line-height: 18px;
      color: #666666;
      padding: 0 1em;
      h1 {
        padding: 1.5em 0;
        text-align: center;
      }
      h3 {
        padding: 0.5em 0;
      }
      p {
        margin: 0.5em 0;
        line-height: 1.7;
        color: rgba(51, 51, 51, 1);
        text-indent: 2em;
      }
      b {
        font-weight: bold;
      }
    }
    .dialog-footer {
      text-align: center;
    }
    .el-scrollbar__wrap {
      overflow-x: hidden;
    }
    .bold {
      //   color: red;
      font-weight: 800;
    }
    .color_red{
      color: red;
    }
  }
</style>


